{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "MusicgenForConditionalGeneration",
    "parent_library": "transformers.models.musicgen.modeling_musicgen"
  },
  "base_model_name_or_path": "facebook/musicgen-small",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "fc1",
    "lm_heads.1",
    "audio_enc_to_dec_proj",
    "embed_tokens.0",
    "k_proj",
    "v_proj",
    "lm_heads.0",
    "lm_heads.2",
    "out_proj",
    "q_proj",
    "enc_to_dec_proj",
    "lm_heads.3",
    "embed_tokens.2",
    "embed_tokens.3",
    "embed_tokens.1",
    "fc2"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}